rafaelwanner/ES_with_Drones/LAB2/STM32 FW Project/Official release - 170120/Src/main.c
/* USER CODE END 0 */

int main(void)
{

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_ADC1_Init();
	MX_TIM2_Init();
	MX_TIM4_Init();
	MX_TIM9_Init();
	MX_USART1_UART_Init();
	//MX_USB_DEVICE_Init();

	/* USER CODE BEGIN 2 */

	PRINTF("PBL - Embedded systems with Drones \n\r\n\r");

	//  Initialize Onboard LED
	BSP_LED_Init(LED1);
	BSP_LED_Init(LED2);
	BSP_LED_Off(LED1);
	BSP_LED_Off(LED2);

	/* Configure and disable all the Chip Select pins for sensors on SPI*/
	Sensor_IO_SPI_CS_Init_All();

	/* Initialize and Enable the available sensors on SPI*/
	initializeAllSensors();
	enableAllSensors();
	/* Initialize UART RX */
	HAL_UART_Receive_IT(&huart1, &data_rx, 1);

	/* Initialize TIM4 for Motors PWM Output*/
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_1);
	/****************************************/
	/* insert here motor control for M2, M3 and M4*/
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_4);

	/* set motor PWM to 0 DC */
	set_motor_pwm_zero(&motor_pwm);

	/* BLE communication */
	PRINTF("LAB2 Init...\n\n");

	/* USER CODE END 2 */
	char c;
	char c_old;
	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{

		/* function to set the PWM */
		/* Note
		 * The PWM is handled by TIM4.
		 * In case of DC motor configuration:
		 * - the master clock for TIM4 is 1MHz
		 * - the counter counts up to 2000, result in 2ms of PWM period (500Hz)
		 * - the PWM pulse width data can to 0~1999, coresponding to 0~100% duty cycle
		 */
		int m1 = motor_pwm.motor1_pwm;
		int m2 = motor_pwm.motor2_pwm;
		int m3 = motor_pwm.motor3_pwm;
		int m4 = motor_pwm.motor4_pwm;

		c = (uint8_t) data_rx;
		if( c_old != c){
			if( c == 's' ) {
				motor_pwm.motor1_pwm = 99;
				motor_pwm.motor2_pwm = 99;
				motor_pwm.motor3_pwm = 99;
				motor_pwm.motor4_pwm = 99;
				set_motor_pwm(&motor_pwm);
				break;

			}
			else if( c == 'o') {
				set_motor_pwm_zero(&motor_pwm);
				break;
			}
			else if( c == 'p') {
				motor_pwm.motor1_pwm = m1 + 100;
				motor_pwm.motor2_pwm = m2 + 100;
				motor_pwm.motor3_pwm = m3 + 100;
				motor_pwm.motor4_pwm = m4 + 100;
				set_motor_pwm(&motor_pwm);
				break;
			}
			else if( c == 'm') {
				motor_pwm.motor1_pwm = m1 - 100;
				motor_pwm.motor2_pwm = m2 - 100;
				motor_pwm.motor3_pwm = m3 - 100;
				motor_pwm.motor4_pwm = m4 - 100;
				set_motor_pwm(&motor_pwm);
				break;
			}
		}

		c_old  = c;







		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */

		//This function provides accurate delay (in milliseconds)
		HAL_Delay(500);
		//BSP_LED_Toggle(LED1);
		//PRINTF("Toggle");

	}
	/* USER CODE END 3 */

}


/* UART reception */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){

	PRINTF("%c", data_rx);
	/* enable UART in RX to receive one byte */
	HAL_UART_Receive_IT(&huart1, &data_rx, 1);

}

/** System Clock Configuration
 */
void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE();

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 16;
	RCC_OscInitStruct.PLL.PLLN = 336;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
	RCC_OscInitStruct.PLL.PLLQ = 7;

	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);


}



/* **************************************************************** */
/* **************************************************************** */
/* **************** FROM LAB2 TO LAB7 - NO LAB1 ! ***************** */
/* **************************************************************** */
/* **************************************************************** */



/* ADC1 init function */
void MX_ADC1_Init(void)
{

	ADC_ChannelConfTypeDef sConfig;

	/**Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
	 */
	hadc1.Instance = ADC1;
	hadc1.Init.ClockPrescaler = ADC_CLOCKPRESCALER_PCLK_DIV4;
	hadc1.Init.Resolution = ADC_RESOLUTION12b;
	hadc1.Init.ScanConvMode = DISABLE;
	hadc1.Init.ContinuousConvMode = DISABLE;
	hadc1.Init.DiscontinuousConvMode = DISABLE;
	hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
	hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
	hadc1.Init.NbrOfConversion = 1;
	hadc1.Init.DMAContinuousRequests = DISABLE;
	hadc1.Init.EOCSelection = EOC_SINGLE_CONV;
	HAL_ADC_Init(&hadc1);

	/**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
	 */
	sConfig.Channel = ADC_CHANNEL_9;
	sConfig.Rank = 1;
	sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
	HAL_ADC_ConfigChannel(&hadc1, &sConfig);

