rafaelwanner/ES_with_Drones/LAB2/STM32 FW Project/Official release - 170120/Src/main.c
		// Save filtered data to acc_FIFO
		acc_FIFO[tim9_cnt2-1].AXIS_X = acc.AXIS_X;
		acc_FIFO[tim9_cnt2-1].AXIS_Y = acc.AXIS_Y;
		acc_FIFO[tim9_cnt2-1].AXIS_Z = acc.AXIS_Z;

		// IIR Filtering on gyro
		gyro_fil.AXIS_X = gyro_fil_coeff.b0*gyro.AXIS_X + gyro_fil_coeff.b1*gyro_x_pre[0].AXIS_X + gyro_fil_coeff.b2*gyro_x_pre[1].AXIS_X
				+ gyro_fil_coeff.a1*gyro_y_pre[0].AXIS_X + gyro_fil_coeff.a2*gyro_y_pre[1].AXIS_X;
		gyro_fil.AXIS_Y = gyro_fil_coeff.b0*gyro.AXIS_Y + gyro_fil_coeff.b1*gyro_x_pre[0].AXIS_Y + gyro_fil_coeff.b2*gyro_x_pre[1].AXIS_Y
				+ gyro_fil_coeff.a1*gyro_y_pre[0].AXIS_Y + gyro_fil_coeff.a2*gyro_y_pre[1].AXIS_Y;
		gyro_fil.AXIS_Z = gyro_fil_coeff.b0*gyro.AXIS_Z + gyro_fil_coeff.b1*gyro_x_pre[0].AXIS_Z + gyro_fil_coeff.b2*gyro_x_pre[1].AXIS_Z
				+ gyro_fil_coeff.a1*gyro_y_pre[0].AXIS_Z + gyro_fil_coeff.a2*gyro_y_pre[1].AXIS_Z;
		// Shift IIR filter state
		for(int i=1;i>0;i--)
		{
			gyro_x_pre[i].AXIS_X = gyro_x_pre[i-1].AXIS_X;
			gyro_x_pre[i].AXIS_Y = gyro_x_pre[i-1].AXIS_Y;
			gyro_x_pre[i].AXIS_Z = gyro_x_pre[i-1].AXIS_Z;
			gyro_y_pre[i].AXIS_X = gyro_y_pre[i-1].AXIS_X;
			gyro_y_pre[i].AXIS_Y = gyro_y_pre[i-1].AXIS_Y;
			gyro_y_pre[i].AXIS_Z = gyro_y_pre[i-1].AXIS_Z;
		}
		gyro_x_pre[0].AXIS_X = gyro.AXIS_X;
		gyro_x_pre[0].AXIS_Y = gyro.AXIS_Y;
		gyro_x_pre[0].AXIS_Z = gyro.AXIS_Z;
		gyro_y_pre[0].AXIS_X = gyro_fil.AXIS_X;
		gyro_y_pre[0].AXIS_Y = gyro_fil.AXIS_Y;
		gyro_y_pre[0].AXIS_Z = gyro_fil.AXIS_Z;

		//  Save filtered data to gyro_FIFO
		gyro_FIFO[tim9_cnt2-1].AXIS_X = gyro_fil.AXIS_X;
		gyro_FIFO[tim9_cnt2-1].AXIS_Y = gyro_fil.AXIS_Y;
		gyro_FIFO[tim9_cnt2-1].AXIS_Z = gyro_fil.AXIS_Z;


		if(tim9_cnt2 == FIFO_Order)
		{
			tim9_cnt2 = 0;
			tim9_event_flag = 1;
			for(int i=0;i<FIFO_Order;i++)
			{
				acc_ahrs_FIFO[i].AXIS_X = acc_FIFO[i].AXIS_X;
				acc_ahrs_FIFO[i].AXIS_Y = acc_FIFO[i].AXIS_Y;
				acc_ahrs_FIFO[i].AXIS_Z = acc_FIFO[i].AXIS_Z;
				gyro_ahrs_FIFO[i].AXIS_X = gyro_FIFO[i].AXIS_X;
				gyro_ahrs_FIFO[i].AXIS_Y = gyro_FIFO[i].AXIS_Y;
				gyro_ahrs_FIFO[i].AXIS_Z = gyro_FIFO[i].AXIS_Z;
			}
		}


		gyro_rad.gx = ((float)gyro_fil.AXIS_X)*((float)COE_MDPS_TO_RADPS);
		gyro_rad.gy = ((float)gyro_fil.AXIS_Y)*((float)COE_MDPS_TO_RADPS);
		gyro_rad.gz = ((float)gyro_fil.AXIS_Z)*((float)COE_MDPS_TO_RADPS);

		euler_ahrs.thz += gyro_rad.gz*PID_SAMPLING_TIME;

		if(gTHR<MIN_THR)
		{
			euler_rc.thz = 0;
			euler_ahrs.thz = 0;
		}

		if (rc_connection_flag && rc_enable_motor)
		{   // Do PID Control
			FlightControlPID_innerLoop(&euler_rc_fil, &gyro_rad, &ahrs, &pid, &motor_pwm);
		}
		else
		{
			// set motor output zero
			set_motor_pwm_zero(&motor_pwm);
		}

		if(gTHR<MIN_THR)
		{
			set_motor_pwm_zero(&motor_pwm);
		}

		set_motor_pwm(&motor_pwm);      /* To comment if want to debug remocon calibration switching off the motors */
	}

}


/**
 * @brief  Initialize all sensors
 * @param  None
 * @retval None
 */
static void initializeAllSensors( void )
{
	if (BSP_ACCELERO_Init( LSM6DSL_X_0, &LSM6DSL_X_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}

	if (BSP_GYRO_Init( LSM6DSL_G_0, &LSM6DSL_G_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}

	if (BSP_MAGNETO_Init( LIS2MDL_M_0, &LIS2MDL_M_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}


	if (BSP_PRESSURE_Init( LPS22HB_P_0, &LPS22HB_P_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}

	if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}


}

/**
 * @brief  Enable all sensors
 * @param  None
 * @retval None
 */
void enableAllSensors( void )
{
	BSP_ACCELERO_Sensor_Enable( LSM6DSL_X_0_handle );
	PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n\r");
	BSP_GYRO_Sensor_Enable( LSM6DSL_G_0_handle );
	PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n\r");
	BSP_MAGNETO_Sensor_Enable( LIS2MDL_M_0_handle );
	PRINTF("LIS2MDL Magnetometer initialized and enabled\n\r");
	BSP_PRESSURE_Sensor_Enable( LPS22HB_P_0_handle );
	PRINTF("LPS22HB Pressure sensor initialized and enabled\n\r");
	BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
	PRINTF("LPS22HB Temperature sensor initialized and enabled\n\r");
}



void BlueNRG_Init(void)
{

	int ret = 1;
	uint8_t  hwVersion=0;
	uint16_t fwVersion=0;

	PRINTF("****** START BLE TESTS ******\r\n");
	BNRG_SPI_Init();

	/* Commented on Jan 15, 2020 */
	// uint8_t tmp_bdaddr[6]= {MAC_BLUEMS};
	// int32_t i;
	/* Commented on Jan 15, 2020 */
	//for(i=0;i<6;i++)
	//  bdaddr[i] = tmp_bdaddr[i];

	/* Added on Jan 15, 2020 */
	bdaddr[0] = (STM32_UUID[1]>>24)&0xFF;
	bdaddr[1] = (STM32_UUID[0]    )&0xFF;
	bdaddr[2] = (STM32_UUID[2] >>8)&0xFF;
	bdaddr[3] = (STM32_UUID[0]>>16)&0xFF;
	bdaddr[4] = (hwVersion > 0x30) ?
			((((0x34-48)*10) + (0x30-48)+100)&0xFF) :
			((((0x34-48)*10) + (0x30-48)    )&0xFF) ;
	bdaddr[5] = 0xC0; /* for a Legal BLE Random MAC */

	/* Initialize the BlueNRG HCI */
	HCI_Init();

	/* Reset BlueNRG hardware */
	BlueNRG_RST();

	/* get the BlueNRG HW and FW versions */
	PRINTF("\r\nReading BlueNRG version ...\r\n");
	if (getBlueNRGVersion(&hwVersion, &fwVersion)== BLE_STATUS_SUCCESS)
	{

		/*
		 * Reset BlueNRG again otherwise it will fail.
		 */
		BlueNRG_RST();

		//PRINTF("Setting Pubblic Address...\r\n");
		/* Commented on Jan 15, 2020 */
		//ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
		//                                CONFIG_DATA_PUBADDR_LEN,
		//                                bdaddr);
		//if(ret){
		//  testStatus = COMPONENT_ERROR;
		//  PRINTF("\r\nSetting Pubblic BD_ADDR failed *****\r\n");
		//  goto fail;
		//}

		PRINTF("GATT Initializzation...\r\n");
		ret = aci_gatt_init();
		if(ret){
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nGATT_Init failed ****\r\n");
			goto fail;
		}

		//    ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
		//                                     7/*strlen(BoardName)*/, (uint8_t *)BoardName);
		//
		//    if(ret){
		//       PRINTF("\r\naci_gatt_update_char_value failed\r\n");
		//      while(1);
		//    }

