rafaelwanner/ES_with_Drones/LAB2/STM32 FW Project/Official release - 170120/Src/main.c
		/* Set the GAP INIT like X-NUCLEO-IDB05A1 eval board  since using same SPBTLE_RF module*/
		ret = aci_gap_init_IDB05A1(GAP_PERIPHERAL_ROLE_IDB05A1, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);

		if(ret != BLE_STATUS_SUCCESS){
			PRINTF("\r\nGAP_Init failed\r\n");
			goto fail;
		}

		// Added Jan 10th
		ret = hci_le_set_random_address(bdaddr);
		// Added Jan 10th
		const char BoardName[7] = {NAME_BLUEMS};
		// Added Jan 10th
		ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
				7/*strlen(BoardName)*/, (uint8_t *)BoardName);

		PRINTF("GAP setting Authentication ....\r\n");
		ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
				OOB_AUTH_DATA_ABSENT,
				NULL, 7, 16,
				USE_FIXED_PIN_FOR_PAIRING, 123456,
				BONDING);
		if (ret != BLE_STATUS_SUCCESS) {
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nGAP setting Authentication failed ******\r\n");
			goto fail;
		}

		PRINTF("SERVER: BLE Stack Initialized \r\n"
				"Board HWver=%d, FWver=%d.%d.%c\r\n"
				"BoardMAC = %x:%x:%x:%x:%x:%x\r\n",
				hwVersion,
				fwVersion>>8,
				(fwVersion>>4)&0xF,
				(hwVersion > 0x30) ? ('a'+(fwVersion&0xF)-1) : 'a',
						bdaddr[5],bdaddr[4],bdaddr[3],bdaddr[2],bdaddr[1],bdaddr[0]);

		/* Set output power level */
		aci_hal_set_tx_power_level(1,4);    /* -2.1dBm */

		ret = Add_ConsoleW2ST_Service();
		if(ret == BLE_STATUS_SUCCESS)
			PRINTF("Console Service W2ST added successfully\r\n");
		else{
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nError while adding Console Service W2ST\r\n");
		}

		ret = Add_ConfigW2ST_Service();
		if(ret == BLE_STATUS_SUCCESS)
			PRINTF("Config  Service W2ST added successfully\r\n");
		else{
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nError while adding Config Service W2ST\r\n");
		}

		PRINTF("\r\nAll test passed!\r\n");
	}
	else {
		testStatus = COMPONENT_ERROR;
		PRINTF("\r\nError in BlueNRG tests. ******\r\n");
	}
	PRINTF("****** END BLE TESTS ******\r\n");
	return;

	fail:
	testStatus = COMPONENT_ERROR;
	return;
}

/** @brief Initialize all the Custom BlueNRG services
 * @param None
 * @retval None
 */
static void Init_BlueNRG_Custom_Services(void)
{
	int ret;

	ret = Add_HWServW2ST_Service();
	if(ret == BLE_STATUS_SUCCESS) {
		PRINTF("HW      Service W2ST added successfully\r\n");
	} else {
		PRINTF("\r\nError while adding HW Service W2ST\r\n");
	}

	ret = Add_ConsoleW2ST_Service();
	if(ret == BLE_STATUS_SUCCESS) {
		PRINTF("Console Service W2ST added successfully\r\n");
	} else {
		PRINTF("\r\nError while adding Console Service W2ST\r\n");
	}

	ret = Add_ConfigW2ST_Service();
	if(ret == BLE_STATUS_SUCCESS) {
		PRINTF("Config  Service W2ST added successfully\r\n");
	} else {
		PRINTF("\r\nError while adding Config Service W2ST\r\n");
	}
}

/**
 * @brief  Send Motion Data Acc/Mag/Gyro to BLE
 * @param  None
 * @retval None
 */
static void SendMotionData(void)
{
	SensorAxes_t ACC_Value;
	SensorAxes_t GYR_Value;
	SensorAxes_t MAG_Value;



	ACC_Value.AXIS_X = acc.AXIS_X;
	ACC_Value.AXIS_Y = acc.AXIS_Y;
	ACC_Value.AXIS_Z = acc.AXIS_Z;
	GYR_Value.AXIS_X = gyro.AXIS_X;
	GYR_Value.AXIS_Y = gyro.AXIS_Y;
	GYR_Value.AXIS_Z = gyro.AXIS_Z;
	MAG_Value.AXIS_X = mag.AXIS_X;
	MAG_Value.AXIS_Y = mag.AXIS_Y;
	MAG_Value.AXIS_Z = mag.AXIS_Z;



	/*Debug */
	//PRINTF("ACC[X, Y, Z]: %d\t%d\t%d\t\n", ACC_Value.AXIS_X, ACC_Value.AXIS_Y, ACC_Value.AXIS_Z);
	//PRINTF("GYRO[X, Y, Z]: %d\t%d\t%d\t\n", GYR_Value.AXIS_X, GYR_Value.AXIS_Y, GYR_Value.AXIS_Z);
	//PRINTF("MAG[X, Y, Z]: %d\t%d\t%d\t\n", MAG_Value.AXIS_X, MAG_Value.AXIS_Y, MAG_Value.AXIS_Z);

	AccGyroMag_Update(&ACC_Value,&GYR_Value,&MAG_Value);

}

static void SendBattEnvData(void)
{
	int32_t decPart, intPart;
	int32_t PressToSend=0;
	uint16_t BattToSend=0;
	int16_t RSSIToSend=0, TempToSend=0;
	int8_t rssi;
	uint16_t conn_handle;

	HAL_ADC_Start(&hadc1);
	if (HAL_ADC_PollForConversion(&hadc1, 1000000) == HAL_OK)
	{
		VBAT_Sense = HAL_ADC_GetValue(&hadc1);
		VBAT = (((VBAT_Sense*3.3)/4095)*(BAT_RUP+BAT_RDW))/BAT_RDW;
		//PRINTF("Battery voltage = %fV\n\n", VBAT);
	}
	HAL_ADC_Stop(&hadc1);

	MCR_BLUEMS_F2I_2D(press, intPart, decPart);
	PressToSend=intPart*100+decPart;
	MCR_BLUEMS_F2I_1D(((int32_t)((float)VBAT*100.0f)/4.2f), intPart, decPart);
	BattToSend = intPart*10+decPart;
	if (BattToSend > 1000){
		BattToSend =1000;
	}
	MCR_BLUEMS_F2I_1D(temperature, intPart, decPart);
	TempToSend = intPart*10+decPart;

	hci_read_rssi(&conn_handle, &rssi);
	RSSIToSend = (int16_t)rssi*10;

	Batt_Env_RSSI_Update(PressToSend,BattToSend,(int16_t) TempToSend,RSSIToSend );

}


static void SendArmingData(void)
{
	ARMING_Update(rc_enable_motor);
}



/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */

}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
